LKR_tut_HPDC22interFoam_10_OCT_ohneInlet_turbulentInlet_Al/constant/particleProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          particleProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

    rhop                     rhop [1 -3 0 0 0 0 0] 2360;
    e                        e [0 0 0 0 0 0 0] 0.85;  //.9
    mu                       mu [0 0 0 0 0 0 0] .2;
    PrPr                     PrPr [0 0 0 0 0 0 0] 10;
    kapkap                   kapkap [1 1 -3 -1 0 0 0] .58;
    CpCppart                 CpCppart [0 2 -2 -1 0 0 0] 4100;

    posP1  	                 posP1 [ 0 1 0 0 0 0 0] (0.044 0.598 0.010);
    dP1  		             dP1 [ 0 1 0 0 0 0 0] 0.000010;
    UP1	            	     UP1 [ 0 1 -1 0 0 0 0] (0 0 0);
    TP1  		             TP1 [ 0 0 0 1 0 0 0] 360;

    posP2 	                 posP2 [ 0 1 0 0 0 0 0] (0.010 0.008 .004);
    dP2 	                 dP2 [ 0 1 0 0 0 0 0] 0.00006;
    UP2		                 UP2 [ 0 1 -1 0 0 0 0] (20 0 0);
    TP2  		             TP2 [ 0 0 0 1 0 0 0] 360;

    tInjStart 	             tInjStart [ 0 0 1 0 0 0 0] 1.5e-4;  //2.5e-5
    tInjEnd 	             tInjEnd [ 0 0 1 0 0 0 0]  8e-4;  //6e-4

    mudrop                   mudrop  [1 -1 -1 0 0 0 0] 1.3e-3;
    sigmad                   sigmad [0 0 0 0 0 0 0] .86;

// ************************************************************************* //
