LKR_tut_HPDC22interFoam_10_OCT_ohneInlet_turbulentInlet_Al/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        //type            fixedValue;
       // value           uniform (50 0 0);

        type            turbulentInlet;
        value           uniform (50 0 0);
        referenceField  uniform (50 0 0);
        fluctuationScale (0.15 0.05 0.05);
    }

    outlet
    {
 	   // type            inletOutlet;
       // inletValue      uniform (0 0 0);
      //  value           uniform (0 0 0);
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);

    }
 

    inletWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    wall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    walls
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
  
 
}


// ************************************************************************* //
