LKR_tut_HPDC22interFoam_10_OCT_ohneInlet_turbulentInlet_Al/0/AlSu
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      AlSu;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 0; 


boundaryField
{
    wall
    {
        type            zeroGradient;
    }
 
    walls
    {
        type            zeroGradient;
    }
    inletWall
    {
        type            zeroGradient;
    }
 
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 0;

    }
    inlet
    {
        type            zeroGradient;
    }
 

}


// ************************************************************************* //
