LKR_tut_HPDC22interFoam_10_OCT_ohneInlet_turbulentInlet_Al/0/B
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volTensorField;
    object      B;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform (0 0 0 0 0 0 0 0 0);

boundaryField
{
   
    inlet
    {
        type            fixedValue;
        value           uniform (0 0 0 0 0 0 0 0 0);
    }

   inletWall
    {
        type            zeroGradient;
    }

   wall
    {
        type            zeroGradient;
    }
 
   walls
    {
        type            zeroGradient;
    }
 


    outlet
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0 0 0 0 0 0 0);
        value           uniform (0 0 0 0 0 0 0 0 0);
    }

 

  
  
}

// ************************************************************************* //
