LKR_tut_HPDC22interFoam_10_OCT_ohneInlet_turbulentInlet_Al/0/R
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      R;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];
internalField   uniform (0 0 0 0 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (3.5 0 0 3.5 0 3.5); 
    }
 
    inletWall
    {
        type            kqRWallFunction;
        value           uniform (0 0 0 0 0 0);
    }

    wall
    {
        type            kqRWallFunction;
        value           uniform (0 0 0 0 0 0);
    }
 
      walls
    {
        type            kqRWallFunction;
        value           uniform (0 0 0 0 0 0);
    }
     outlet
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0 0 0 0);
        value           uniform (0 0 0 0 0 0);
    }

}


// ************************************************************************* //
