LKR_tut_HPDC22interFoam_10_OCT_ohneInlet_turbulentInlet_Al/0/criterion2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      criterion;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 2 -2 0 0 0 0];

internalField   uniform 0; 


boundaryField
{
 
    inletWall
    {
        type            zeroGradient;
    }
 
     wall
    {
        type            zeroGradient;
    }
     walls
    {
        type            zeroGradient;
    }

    outlet
    {
        type            calculated; 

    }
    inlet
    {
        type            zeroGradient;
    }
 
}


// ************************************************************************* //
