LKR_tut_HPDC22interFoam_10_OCT_ohneInlet_turbulentInlet_Al/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


defaultFieldValues
(
    volScalarFieldValue alpha1 0
);

regions
(
    boxToCell
    {
        box ( -5 -3 -10 ) ( 0.091 5 10 );
        fieldValues
        (
            volScalarFieldValue alpha1 1
            volScalarFieldValue T 363
          //  volVectorFieldValue U (10 0 0)

//pos().x < .091 && pos().y > -3

        );
    }
);


// ************************************************************************* //
